In [1]:
import pandas as pd

In [2]:
list_series = pd.Series([10,20,30,40,50],name="Numbers")
print(list_series)
print(type(list_series))

0    10
1    20
2    30
3    40
4    50
Name: Numbers, dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
bio_list = [
    ["Adam", 25, "Havana"],
    ["Ruth", 19, "LA"],
    ["Brad", 24, "Colorado"]
]

bio_data = pd.DataFrame(bio_list,columns=["Name","Age", "City"],index=[1,2,3])
bio_data

   Name  Age      City
1  Adam   25    Havana
2  Ruth   19        LA
3  Brad   24  Colorado

In [4]:
student_data = pd.read_csv("student_data.csv")
student_data

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet
4,PH1005,Kamal Uddin,NaN,NaN,95.0,In Progress,2024-03-05,Mr. Karim,Chattogram
5,PH1006,Laila Begum,75.0,75.0,78.0,Completed,2024-03-08,Ms. Salma,Rajshahi
6,PH1007,Mahmudul Hasan,80.0,80.0,NaN,In Progress,2024-04-01,Mr. Karim,Dhaka
7,PH1008,Nadia Islam,81.0,81.0,85.0,Completed,2024-04-22,Ms. Salma,Chattogram
8,PH1009,Omar Faruq,72.0,72.0,76.0,Completed,2024-05-16,Mr. David,Dhaka
9,PH1010,Priya Sharma,89.0,89.0,88.0,Completed,2024-05-20,Ms. Salma,Sylhet
10,PH1011,Rahim Sheikh,NaN,NaN,91.0,In Progress,2024-06-11,Mr. Karim,Khulna
11,PH1012,Sadia Chowdhury,85.0,85.0,87.0,Completed,2024-06-14,Ms. Salma,Chattogram
12,PH1013,Tanvir Ahmed,75.0,75.0,79.0,Completed,2024-07-02,Mr. David,Dhaka
13,PH1014,Urmi Akter,NaN,NaN,NaN,Not Started,2024-07-09,Ms. Salma,Rajshahi
14,PH1015,Wahiduzzaman,86.0,86.0,84.0,Completed,2024-08-18,Mr. Karim,Dhaka
15,PH1016,Ziaur Rahman,94.0,94.0,NaN,In Progress,2024-08-21,Ms. Salma,Chattogram
16,PH1017,Afsana Mimi,90.0,90.0,93.0,Completed,2025-09-01,Mr. Karim,Dhaka
17,PH1018,Babul Ahmed,88.0,88.0,85.0,Completed,2025-09-05,Ms. Salma,Sylhet
18,PH1019,Faria Rahman,NaN,NaN,NaN,Not Started,2025-09-15,Mr. David,Chattogram
19,PH1020,Nasir Khan,86.0,86.0,89.0,Completed,2025-10-02,Ms. Salma,Dhaka

In [5]:
data_cols= student_data.columns
data_rows = len(student_data)
print("Number of Columns: ",len(data_cols))
print("Number of Rows: ",(data_rows))

col_FullName_type = student_data.FullName.dtypes
col_Python_Marks_type = student_data["Python Marks"].dtypes
col_EnrollmentDate_type = student_data.EnrollmentDate.dtypes

print("FullName Type: ", col_FullName_type)
print("Python Marks Type: ", col_Python_Marks_type)
print("EnrollmentDate Type: ", col_EnrollmentDate_type)

Number of Columns:  9
Number of Rows:  20
FullName Type:  object
Python Marks Type:  float64
EnrollmentDate Type:  object

In [6]:
student_data_statistics = student_data.describe()
student_data_statistics

       Data Structure Marks  Algorithm Marks  Python Marks
count             16.000000        16.000000     15.000000
mean              84.000000        84.000000     85.666667
std                6.501282         6.501282      5.394000
min               72.000000        72.000000     76.000000
25%               79.500000        79.500000     83.000000
50%               85.500000        85.500000     85.000000
75%               88.250000        88.250000     88.500000
max               94.000000        94.000000     95.000000

In [7]:


demo_data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}

In [8]:
data = pd.DataFrame(demo_data)

In [9]:
data

  Product  Price  Quantity
0     Pen     10       100
1    Book     50        60
2  Eraser      5       200
3  Pencil      7       150

In [10]:
data_cols = data.columns
data_cols

Index(['Product', 'Price', 'Quantity'], dtype='object')

In [11]:
data_index = data.index

data_index

RangeIndex(start=0, stop=4, step=1)

In [12]:
data_price_col = data.Price

data_price_col

0    10
1    50
2     5
3     7
Name: Price, dtype: int64

In [13]:
data_product_col = data.Product

data_product_col

0       Pen
1      Book
2    Eraser
3    Pencil
Name: Product, dtype: object

In [14]:
data_selected_row = data[0:3]

data_selected_row

  Product  Price  Quantity
0     Pen     10       100
1    Book     50        60
2  Eraser      5       200

In [15]:
data

  Product  Price  Quantity
0     Pen     10       100
1    Book     50        60
2  Eraser      5       200
3  Pencil      7       150

In [16]:
data.loc[1:2,["Product","Price"]]

  Product  Price
1    Book     50
2  Eraser      5

In [17]:
data[:1]

  Product  Price  Quantity
0     Pen     10       100

In [18]:
data.loc[0]

Product     Pen
Price        10
Quantity    100
Name: 0, dtype: object

In [19]:
data.loc[:,["Price"]]

   Price
0     10
1     50
2      5
3      7

In [20]:
data.loc[:,"Product"]

0       Pen
1      Book
2    Eraser
3    Pencil
Name: Product, dtype: object

In [21]:
data.iloc[0]

Product     Pen
Price        10
Quantity    100
Name: 0, dtype: object

In [22]:
data.iloc[:,[data.columns.get_loc("Product"), data.columns.get_loc("Price")]]

  Product  Price
0     Pen     10
1    Book     50
2  Eraser      5
3  Pencil      7

In [23]:
data.iloc[:,[1]]

   Price
0     10
1     50
2      5
3      7

In [24]:
data[1:3][["Product","Price"]]

  Product  Price
1    Book     50
2  Eraser      5

In [25]:
student_data

,StudentID,FullName,Data Structure Marks,Algorithm Marks,Python Marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH1001,Alif Rahman,85.0,85.0,88.0,Completed,2024-01-15,Mr. Karim,Dhaka
1,PH1002,Fatima Akhter,92.0,92.0,NaN,In Progress,2024-01-20,Ms. Salma,Chattogram
2,PH1003,Imran Hossain,88.0,88.0,85.0,Completed,2024-02-10,Mr. Karim,Dhaka
3,PH1004,Jannatul Ferdous,78.0,78.0,82.0,Completed,2024-02-12,Ms. Salma,Sylhet
4,PH1005,Kamal Uddin,NaN,NaN,95.0,In Progress,2024-03-05,Mr. Karim,Chattogram
5,PH1006,Laila Begum,75.0,75.0,78.0,Completed,2024-03-08,Ms. Salma,Rajshahi
6,PH1007,Mahmudul Hasan,80.0,80.0,NaN,In Progress,2024-04-01,Mr. Karim,Dhaka
7,PH1008,Nadia Islam,81.0,81.0,85.0,Completed,2024-04-22,Ms. Salma,Chattogram
8,PH1009,Omar Faruq,72.0,72.0,76.0,Completed,2024-05-16,Mr. David,Dhaka
9,PH1010,Priya Sharma,89.0,89.0,88.0,Completed,2024-05-20,Ms. Salma,Sylhet
10,PH1011,Rahim Sheikh,NaN,NaN,91.0,In Progress,2024-06-11,Mr. Karim,Khulna
11,PH1012,Sadia Chowdhury,85.0,85.0,87.0,Completed,2024-06-14,Ms. Salma,Chattogram
12,PH1013,Tanvir Ahmed,75.0,75.0,79.0,Completed,2024-07-02,Mr. David,Dhaka
13,PH1014,Urmi Akter,NaN,NaN,NaN,Not Started,2024-07-09,Ms. Salma,Rajshahi
14,PH1015,Wahiduzzaman,86.0,86.0,84.0,Completed,2024-08-18,Mr. Karim,Dhaka
15,PH1016,Ziaur Rahman,94.0,94.0,NaN,In Progress,2024-08-21,Ms. Salma,Chattogram
16,PH1017,Afsana Mimi,90.0,90.0,93.0,Completed,2025-09-01,Mr. Karim,Dhaka
17,PH1018,Babul Ahmed,88.0,88.0,85.0,Completed,2025-09-05,Ms. Salma,Sylhet
18,PH1019,Faria Rahman,NaN,NaN,NaN,Not Started,2025-09-15,Mr. David,Chattogram
19,PH1020,Nasir Khan,86.0,86.0,89.0,Completed,2025-10-02,Ms. Salma,Dhaka

In [26]:
res_data = student_data[0:4][["StudentID", "FullName","Algorithm Marks"]].reset_index(drop=True)
res_data.index+=1

res_data

  StudentID          FullName  Algorithm Marks
1    PH1001       Alif Rahman             85.0
2    PH1002     Fatima Akhter             92.0
3    PH1003     Imran Hossain             88.0
4    PH1004  Jannatul Ferdous             78.0

In [27]:
employee_data = pd.DataFrame(
    [
        ["Raju", "YouTube", "124000"],
        ["Alex", "YouTube", "89000"],
        ["Brett", "YouTube", "140000"],
        ["Grett", "YouTube","140000"]
        ], columns=["Name", "Department", "Salary"]
)
sorted_data =employee_data.sort_values(["Salary", "Name"],ascending=[True, False]).reset_index(drop=True)
sorted_data.index+=1

sorted_data

    Name Department  Salary
1   Raju    YouTube  124000
2  Grett    YouTube  140000
3  Brett    YouTube  140000
4   Alex    YouTube   89000

In [28]:

students_info = pd.DataFrame(
    {
        "Name": ["Alice", "Bob", "Charlie", "Diana", "Ethan", "Fiona", "George", "Hannah"],
        "Score": [85, 92, 78, 38, 95, 67, 80, 90]
    }
)

students_info

      Name  Score
0    Alice     85
1      Bob     92
2  Charlie     78
3    Diana     38
4    Ethan     95
5    Fiona     67
6   George     80
7   Hannah     90

In [29]:
above_target = students_info[students_info.Score > 60].reset_index(drop=True)
above_target

      Name  Score
0    Alice     85
1      Bob     92
2  Charlie     78
3    Ethan     95
4    Fiona     67
5   George     80
6   Hannah     90